_posts/technology/2021-12-20-cppcoreguidelines-p3.html
---
layout: post
title: CppCoreGuidelines P.3 明确地表达程序意图
categories: [technology]
tags: [CppCoreGuidelines]
---

<ul class="org-ul">
<li><a href="http://kimi.im/2021-12-18-cppcoreguidelines-p1">P.1 直接地用代码表达编程设计理念</a></li>
<li><a href="http://kimi.im/2021-12-20-cppcoreguidelines-p2">P.2 用 ISO C++ 标准写代码</a></li>
</ul>


<p>
如果要读代码注释才能理解代码意图，那可能就意味着代码写的不够清晰，代码意图没有明确地表达了。
</p>

<p>
例如，以下例子：
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #000000; font-style: italic; text-decoration: underline;">vector</span><span style="color: #707183;">&lt;</span><span style="color: #000000; font-style: italic; text-decoration: underline;">int</span><span style="color: #707183;">&gt;</span> <span style="color: #000000;">v</span> = <span style="color: #707183;">{</span>1, 2, 3, 4, 5<span style="color: #707183;">}</span>;
<span style="color: #110099;">gsl</span>::<span style="color: #000000; font-style: italic; text-decoration: underline;">index</span> <span style="color: #000000;">i</span> = 0;
<span style="color: #7F0055; font-weight: bold;">while</span> <span style="color: #707183;">(</span>i &lt; v.size<span style="color: #7388d6;">()</span><span style="color: #707183;">)</span> <span style="color: #707183;">{</span>
    cout &lt;&lt; v<span style="color: #7388d6;">[</span>i<span style="color: #7388d6;">]</span> &lt;&lt; <span style="color: #2A00FF;">" "</span>;
    i++;
<span style="color: #707183;">}</span>
</pre>
</div>

<pre class="example">
1 2 3 4 5 
</pre>


<p>
这里，我们的意图其实就是要循环一遍 <code>v</code> ，把其元素的值打印出来。然而，别人可能无法一眼看出来代码要做的事情。并且，代码里还多余的定义了一个索引变量 <code>i</code> ，这个变量的有效范围还超出了循环体。
</p>


<p>
倘若把 <code>while</code> 循环改成以下 <code>for</code> 循环，就比较直截了当了：
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #000000; font-style: italic; text-decoration: underline;">vector</span><span style="color: #707183;">&lt;</span><span style="color: #000000; font-style: italic; text-decoration: underline;">int</span><span style="color: #707183;">&gt;</span> <span style="color: #000000;">v</span> = <span style="color: #707183;">{</span>1, 2, 3, 4, 5<span style="color: #707183;">}</span>;
<span style="color: #7F0055; font-weight: bold;">for</span> <span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">const</span> <span style="color: #7F0055; font-weight: bold;">auto</span>&amp; <span style="color: #000000;">x</span> : v<span style="color: #707183;">)</span> <span style="color: #707183;">{</span>
    cout &lt;&lt; x &lt;&lt; <span style="color: #2A00FF;">" "</span>;
<span style="color: #707183;">}</span>
</pre>
</div>

<pre class="example">
1 2 3 4 5 
</pre>


<p>
并且，还用了 <code>const</code> 修饰 <code>x</code> ，表示循环内不会修改 <code>x</code> 的值。如果循环中修改了 <code>x</code> 的值，编译器会报错。
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #000000; font-style: italic; text-decoration: underline;">vector</span><span style="color: #707183;">&lt;</span><span style="color: #000000; font-style: italic; text-decoration: underline;">int</span><span style="color: #707183;">&gt;</span> <span style="color: #000000;">v</span> = <span style="color: #707183;">{</span>1, 2, 3, 4, 5<span style="color: #707183;">}</span>;
<span style="color: #7F0055; font-weight: bold;">for</span> <span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">const</span> <span style="color: #7F0055; font-weight: bold;">auto</span>&amp; <span style="color: #000000;">x</span> : v<span style="color: #707183;">)</span> <span style="color: #707183;">{</span>
    cout &lt;&lt; ++x &lt;&lt; <span style="color: #2A00FF;">" "</span>;
<span style="color: #707183;">}</span>
</pre>
</div>

<pre class="example" id="orgc84a2bc">
C-src-eO7Jst.cpp: In function 'int main()':
C-src-eO7Jst.cpp:14:15: error: increment of read-only reference 'x'
   14 |     cout &lt;&lt; ++x &lt;&lt; " ";
      |               ^
</pre>

<p>
如果明确要在循环中修改 <code>x</code> ，那么可以去掉 <code>const</code> ：
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #000000; font-style: italic; text-decoration: underline;">vector</span><span style="color: #707183;">&lt;</span><span style="color: #000000; font-style: italic; text-decoration: underline;">int</span><span style="color: #707183;">&gt;</span> <span style="color: #000000;">v</span> = <span style="color: #707183;">{</span>1, 2, 3, 4, 5<span style="color: #707183;">}</span>;
<span style="color: #7F0055; font-weight: bold;">for</span> <span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">auto</span>&amp; <span style="color: #000000;">x</span> : v<span style="color: #707183;">)</span> <span style="color: #707183;">{</span>
    cout &lt;&lt; ++x &lt;&lt; <span style="color: #2A00FF;">" "</span>;
<span style="color: #707183;">}</span>
</pre>
</div>

<pre class="example">
2 3 4 5 6 
</pre>


<p>
也可以用 <code>std::ranges::for_each</code> 更清晰的表达程序意图：
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #000000; font-style: italic; text-decoration: underline;">vector</span><span style="color: #707183;">&lt;</span><span style="color: #000000; font-style: italic; text-decoration: underline;">int</span><span style="color: #707183;">&gt;</span> <span style="color: #000000;">v</span> = <span style="color: #707183;">{</span>1, 2, 3, 4, 5, 6, 7, 8, 9, 0<span style="color: #707183;">}</span>;
<span style="color: #110099;">std</span>::<span style="color: #110099;">ranges</span>::for_each<span style="color: #707183;">(</span>v, <span style="color: #7388d6;">[](</span><span style="color: #7F0055; font-weight: bold;">const</span> <span style="color: #7F0055; font-weight: bold;">auto</span> &amp;<span style="color: #000000;">x</span><span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span> cout &lt;&lt; x &lt;&lt; <span style="color: #2A00FF;">" "</span>; <span style="color: #7388d6;">}</span><span style="color: #707183;">)</span>;
</pre>
</div>

<pre class="example">
1 2 3 4 5 6 7 8 9 0 
</pre>


<p>
需要注意的是，在 <code>algorithm</code> 中，也有一个 <code>std::for_each</code> ，它的前两个参数是 <code>InputIterator</code> ：
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #000000; font-style: italic; text-decoration: underline;">vector</span><span style="color: #707183;">&lt;</span><span style="color: #000000; font-style: italic; text-decoration: underline;">int</span><span style="color: #707183;">&gt;</span> <span style="color: #000000;">v</span> = <span style="color: #707183;">{</span>1, 2, 3, 4, 5, 6, 7, 8, 9, 0<span style="color: #707183;">}</span>;
for_each<span style="color: #707183;">(</span>begin<span style="color: #7388d6;">(</span>v<span style="color: #7388d6;">)</span>, end<span style="color: #7388d6;">(</span>v<span style="color: #7388d6;">)</span>, <span style="color: #7388d6;">[](</span><span style="color: #000000; font-style: italic; text-decoration: underline;">int</span> <span style="color: #000000;">x</span><span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span> cout &lt;&lt; x &lt;&lt; <span style="color: #2A00FF;">" "</span>; <span style="color: #7388d6;">}</span><span style="color: #707183;">)</span>;
</pre>
</div>

<pre class="example">
1 2 3 4 5 6 7 8 9 0 
</pre>


<p>
如果，循环访问的时候，不用按顺序，可以添加 <code>execute::par</code> 表示并行访问。因为 <code>v</code> 的元素不够多，所以看不出什么变化：
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #000000; font-style: italic; text-decoration: underline;">vector</span><span style="color: #707183;">&lt;</span><span style="color: #000000; font-style: italic; text-decoration: underline;">int</span><span style="color: #707183;">&gt;</span> <span style="color: #000000;">v</span> = <span style="color: #707183;">{</span>1, 2, 3, 4, 5, 6, 7, 8, 9, 0<span style="color: #707183;">}</span>;
for_each<span style="color: #707183;">(</span><span style="color: #110099;">execution</span>::par, v.begin<span style="color: #7388d6;">()</span>, v.end<span style="color: #7388d6;">()</span>, <span style="color: #7388d6;">[](</span><span style="color: #000000; font-style: italic; text-decoration: underline;">int</span> <span style="color: #000000;">x</span><span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span> cout &lt;&lt; x &lt;&lt; <span style="color: #2A00FF;">" "</span>; <span style="color: #7388d6;">}</span><span style="color: #707183;">)</span>;
</pre>
</div>

<pre class="example">
1 2 3 4 5 6 7 8 9 0 
</pre>


<p>
如果要表示在两点间画线，以下两种写法里，第二种就比较明确：
</p>

<div class="org-src-container">
<pre class="src src-C++">draw_line<span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">int</span>, <span style="color: #000000; font-style: italic; text-decoration: underline;">int</span>, <span style="color: #000000; font-style: italic; text-decoration: underline;">int</span>, <span style="color: #000000; font-style: italic; text-decoration: underline;">int</span><span style="color: #707183;">)</span>;  <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">obscure</span>
draw_line<span style="color: #707183;">(</span>Point, Point<span style="color: #707183;">)</span>;        <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">clearer</span>
</pre>
</div>


<p>
一些建议：
</p>
<ul class="org-ul">
<li>熟悉掌握指南支持的程序库（guidelines support library, gsl）</li>
<li>熟悉了解 ISO C++ 标准库</li>
<li>其他项目中使用的基础库</li>
</ul>


<p>
一些需要注意的地方：
</p>
<ul class="org-ul">
<li>简单的 for 循环 vs. 带范围的 <code>for_each</code></li>
<li><code>f(T*, int)</code> 接口 vs. <code>f(span&lt;T&gt;)</code> 接口</li>
<li>循环变量超出循环体范围</li>
<li>naked <code>new</code> and <code>delete</code> （没看懂……）</li>
<li>有过多内置类型的函数参数</li>
</ul>
